"""min_loop"""
def min_loop():
    """main"""
    # N คือจำนวนรอบที่เรากำหนดว่าต้องรับค่าตัวเลขกี่ตัว
    N = int(input())
    # ถ้าจำนวนข้อมูลน้อยกว่าหรือเท่ากับ 0 ก็จบการทำงาน
    if N <= 0:
        return
     # รับค่าตัวแรกมาเก็บไว้เป็นค่าน้อยที่สุดก่อน เพราะยังไม่มีค่าอื่นให้เปรียบเทียบ
    min_number = int(input())
    # วนรับข้อมูลที่เหลืออีก N-1 ตัว ที่ต้องลบ1
    # เพราะเรามีเลขตัวแรกเก็บไว้ในmin_numberอยู่แล้วจึงต้องรับค่าน้อยลง1เลข
    for _ in range (N - 1) :
        # รับค่าปัจจุบันเพื่ือนำไปเปรียบเทียบ
        num = int(input())
        # ถ้าค่าปัจจุบันน้อยกว่าค่าน้อยที่สุดเดิมให้อัปเดตค่าน้อยที่สุด หากไม่ก็ใช้ค่าเดิม
        if num < min_number :
            min_number = num
    print(min_number)
min_loop()
